--[[1001

]]
local t = {
'o_animquest',
{
	{
		['name']=0x10010001,
		['showname']='卡牌平移',
		['is_mono']=false,
		['time']=1000,
		['iter']={
			[1]={n=4,[1] = '动画系统_属性累加',
				[2]='::Card',
				[3]='x',
				[4]=100,
			},
			[2]={n=4,[1] = '动画系统_属性累加',
				[2]='::Card',
				[3]='y',
				[4]=-100,
			},
		},
	},
	{
		['name']=0x10010002,
		['showname']='卡牌缩小',
		['is_mono']=false,
		['time']=1000,
		['iter']={
			[1]={n=4,[1] = '动画系统_属性设置',
				[2]='::Card',
				[3]='scaleX',
				[4]=0.3,
			},
			[2]={n=4,[1] = '动画系统_属性设置',
				[2]='::Card',
				[3]='scaleY',
				[4]=0.3,
			},
		},
	},
	{
		['name']=0x10010003,
		['showname']='卡牌_更改费用',
		['is_mono']=true,
		['time']=1000,
		['iter']={
			[1]={n=4,[1] = '动画系统_属性设置',
				[2]='::Card.卡牌框.c_card_weapon',
				[3]='cost',
				[4]=100,
			},
		},
	},
	{
		['name']=0x10010004,
		['showname']='卡牌_更改费用',
		['is_mono']=true,
		['time']=1000,
		['iter']={
			[1]={n=4,[1] = '动画系统_属性设置',
				[2]='::Card.卡牌框.c_card_weapon',
				[3]='cost',
				[4]=-50,
			},
		},
	},
}}
return t