--[[1016

]]
local t = {
'o_battle_ai',
{
	{
		['name']=0x10160001,
		['showname']='有什么用什么AI',
		['AI名称库']={
			[1]='弱智酒馆老板',
		},
		['AI卡组']={
			[1]=0x100d0001,
		},
		['AI行为树']=0x10170001,
		['支持游戏模式']={
			[1]=0x10150001,
			[2]=0x10150002,
			[3]=0x10150003,
		},
		['AI逻辑']={
			[1]={
				['时机']='流程_游戏开始',
				['处理函数']='AI逻辑_弱智酒馆老板_游戏开始',
			},
			[2]={
				['时机']='流程_回合开始',
				['处理函数']='AI逻辑_弱智酒馆老板_回合开始',
			},
			[3]={
				['时机']='流程_回合结束',
				['处理函数']='AI逻辑_弱智酒馆老板_回合结束',
			},
		},
	},
}}
return t