--[[1002

]]
local t = {
'o_cheat_system_item',
{
	{
		['name']=0x10020001,
		['showname']='添加手牌',
		['执行函数']='角色_添加手牌 %s 0x1006%s',
		['默认参数']='我方 0003',
	},
	{
		['name']=0x10020002,
		['showname']='删除手牌',
		['执行函数']='角色_移除手牌 %s %s',
		['默认参数']='我方 1',
	},
	{
		['name']=0x10020003,
		['showname']='添加手牌',
		['执行函数']='角色_添加手牌 %s 0x1006%s',
		['默认参数']='敌方1 0003',
	},
	{
		['name']=0x10020004,
		['showname']='删除手牌',
		['执行函数']='角色_移除手牌 %s %s',
		['默认参数']='敌方1 1',
	},
	{
		['name']=0x10020005,
		['showname']='注册卡牌指令',
		['执行函数']='zpc_test %s %s %s %s %s',
		['默认参数']='5 4 3 2 1',
	},
}}
return t