--[[1015

]]
local t = {
'o_game_mode',
{
	{
		['name']=0x10150001,
		['showname']='挑战酒馆老板',
		['id']=1,
		['模式名称'] = '挑战酒馆老板',
		['开始条件'] = '模式条件_挑战酒馆老板开始条件',
		['初始化函数名'] = '对决_初始化1v1战场',
		['可分配身份列表'] = {'红1', '蓝1'}
	},
	{
		['name']=0x10150003,
		['showname']='1v1',
		['id']=2,
		['模式名称'] = '1v1',
		['开始条件'] = '模式条件_1v1开始条件',
		['初始化函数名'] = '对决_初始化1v1战场',
		['可分配身份列表'] = {'红1', '蓝1'}
	},
	{
		['name']=0x10150002,
		['showname']='2v2',
		['id']=3,
		['模式名称'] = '2v2',
		['开始条件'] = '模式条件_2v2开始条件',
		['初始化函数名'] = '对决_初始化2v2战场',
		['可分配身份列表'] = {'红1', '蓝1', '红2', '蓝2'}
	},
}}
return t