--[[1014

]]
local t = {
'o_randomiter',
{
	{
		['name']=0x10140001,
		['showname']='动物伙伴',
		['prefix']='猎人',
		['默认数据']={
			[1]={
				['卡牌']=0x1006001b,
				['权重']=100,
			},
			[2]={
				['卡牌']=0x1006001c,
				['权重']=100,
			},
			[3]={
				['卡牌']=0x1006001d,
				['权重']=100,
			},
		},
		['随机库类型']=0x100c0002,
	},
	{
		['name']=0x10140002,
		['showname']='图腾召唤',
		['prefix']='萨满祭司',
		['默认数据']={
			[1]={
				['卡牌']=0x10060059,
				['权重']=100,
				['条件']={n=1,[1] = 'fargboolean_not',
					[2]={n=2,[1] = '卡牌条件_控制特定卡牌',
						[2]='我方',
						['__3']=0x10060059,
					},
				},
			},
			[2]={
				['卡牌']=0x1006005a,
				['权重']=100,
				['条件']={n=1,[1] = 'fargboolean_not',
					[2]={n=2,[1] = '卡牌条件_控制特定卡牌',
						[2]='我方',
						['__3']=0x1006005a,
					},
				},
			},
			[3]={
				['卡牌']=0x1006005b,
				['权重']=100,
				['条件']={n=1,[1] = 'fargboolean_not',
					[2]={n=2,[1] = '卡牌条件_控制特定卡牌',
						[2]='我方',
						['__3']=0x1006005b,
					},
				},
			},
			[4]={
				['卡牌']=0x1006005c,
				['权重']=100,
				['条件']={n=1,[1] = 'fargboolean_not',
					[2]={n=2,[1] = '卡牌条件_控制特定卡牌',
						[2]='我方',
						['__3']=0x1006005c,
					},
				},
			},
		},
		['随机库类型']=0x100c0002,
	},
}}
return t